{
  "menu-about": "ABOUT ME",
  "menu-experience" : "EXPERIENCE",
  "menu-skills": "SKILLS",
  "menu-portfolio": "PORTFOLIO",
  "menu-price": "PRICE",
  "menu-contacts": "CONTACTS",
  "name": "My name is Elijah",
  "promo-title": "I am a Fullstack Developer from Belgrade",
  "about-text": "I am able to work in a multitasking mode. I possess strong analytical skills that enable me to effectively work with large amounts of information and find high-quality solutions to assigned tasks. I am constantly learning and practicing to solve current challenges. Here are the fields in which I practice:",
  "skills-web-title": "Web Development",
  "skills-web-text": "Cross-browser layout, creating interactive and responsive websites, web applications using native tools, or with the help of Vue...",
  "skills-app-title": "Application Development",
  "skills-app-text": "Developing web applications, SPAs using the Vue framework, React library",
  "skills-sql-title": "Databases",
  "skills-sql-text": "I have experience working with SQL, including creating and modifying databases, writing stored procedures and functions, optimizing query performance. Additionally, I also have skills in data analysis, such as collecting, processing and interpreting information, creating reports and dashboards to support decision-making.",
  "resume-title": "I can help you with",
  "resume-education": "Education",
  "resume-university": "Petrozavodsk State University",
  "resume-university-subtitle": "Bachelor's degree | Petrozavodsk (2013-2018)",
  "resume-university-description": "Physico-Technical Institute. Pedagogical education with two specialized tracks (physics and mathematics).",
  "resume-geekBrains": "GeekBrains, Mail.ru group",
  "resume-geekBrains-subtitle": "HTML&CSS 2020",
  "resume-geekBrains-description": "Learning HTML & CSS, as well as preprocessors like Less and Sass, has helped me write more beautiful code",
  "resume-udemy-web": "Udemy",
  "resume-udemy-web-subtitle": "Web-developer 2020",
  "resume-udemy-web-description": "I have extensively studied web development, HTML, and CSS. Additionally, I have hands-on experience with build tools such as Gulp and Webpack, as well as with style preprocessors such as Less and Sass/Scss. I have also studied JavaScript and the jQuery library, allowing me to create dynamic and interactive websites.",
  "resume-udemy-js-react": "Udemy",
  "resume-udemy-js-react-subtitle": "Complete JavaScript + React course - from zero to result, 2021",
  "resume-udemy-js-react-description": "I have extensively studied JavaScript, which allows me to create dynamic and interactive websites. In addition, I have studied build tools like Webpack and learned the NodeJS platform for creating server-side applications. I have also studied the React framework and the Redux state management library, which enables me to build scalable and complex web applications. I have successfully applied this knowledge in practice, creating various projects and participating in commercial projects.",
  "resume-ano": "Autonomous Non-Commercial Organization of Additional Professional Education 'Center of Profile Education'",
  "resume-ano-subtitle": "Center of Profile Education, Modern Web Development, 2021.",
  "resume-ano-description": "During the course of my studies, I learned the principles of modern web development, including the latest HTML and CSS standards, JavaScript, as well as popular frameworks and libraries such as React and Vue3. I also gained a basic understanding of server-side development, by studying Node.js and databases.",
  "resume-experience": "My experience",
  "resume-experience-FD": "Web-developer/Freelance",
  "resume-experience-FD-subtitle": "Since c 2020",
  "resume-experience-FD-description": "During my education and freelance practice, I have completed independent projects and gained experience in developing web applications using various technologies such as JavaScript, React, Vue, Webpack, and others. I have also participated in application development and startup idea implementation to gain more experience. In my work, I have been involved in website layout, cross-browser testing, refactoring my own and others' code, working with data on both the server and client sides, testing websites and scripts. I have also actively used the Git version control system and practiced TDD, using the Jest library for unit testing.",
  "resume-experience-kmis": "Fullstack developer",
  "resume-experience-kmis-subtitle": "K-Sky (since 2022)",
  "resume-experience-kmis-description": "I work as a fullstack developer, specializing in frontend development using React with TypeScript and GraphQL, as well as backend development using Python and Django. My skills also include working with databases, including creating table structures, relationships, and calculations. I confidently implement and integrate new functionality, work on improving SQL scripts, and create analytics for decision-makers so they can make informed decisions based on data. My work also involves working with Celery, Kafka, and Redis to ensure scalability and reliability of applications. I am constantly improving my skills and enthusiastically following the latest industry trends to ensure optimal application functionality.",
  "skills-subtitle": "What I use in my work",
  "skills-js": "This programming language allows me to bring anything to life: sliders, windows, tooltips, tabs, fetching data from the server, and much more.",
  "skills-python": "This programming language is widely used in web applications, software development, and is often used for data analysis and processing.",
  "skills-postgresql": "This is a relational database management system that will store the data of your website or application.",
  "skills-sql": "A declarative programming language used to create, modify, and manage data in a relational database.",
  "skills-html": "It creates the framework of your website or application, and the fifth version allows me to create a more SEO-optimized structure for your product.",
  "skills-css": "This style language allows me to create any appearance for your website or application. It's limited only by your imagination!",
  "skills-react": "React is a declarative, efficient, and flexible JavaScript library for building user interfaces. It allows me to assemble complex UI from small isolated pieces of code - 'components.'",
  "skills-vue": "This framework allows us to create web applications. We can create a highly interactive product tailored to your goals.",
  "skills-vuetify": "This is a progressive framework that helps speed up web development if there is no need for personalized design.",
  "skills-jquery": "The Jquery library will speed up development. We won't integrate it into the project if there's no need for it, but we have the skill to work with it.",
  "skills-webpack": "One of the most powerful and flexible module bundlers, allowing us to develop your product quickly and with high quality, using different libraries and frameworks.",
  "skills-babel": "Babel is a transpiler that helps us rewrite code from the modern Javascript standard to support earlier browser versions.",
  "skills-git": "Git is a version control system with a distributed architecture.",
  "skills-gulp": "Gulp is a task manager for automatically performing commonly used tasks (such as minification, testing, file concatenation)...",
  "skills-sass": "Sass is a meta-language based on CSS, designed to increase the level of abstraction of CSS code. By using it, we simplify cascading style sheet files.",
  "skills-bootstrap": "A free set of tools for creating websites and web applications. It helps us develop products faster if there are no strict layout requirements.",
  "skills-json": "A text-based data exchange format based on JavaScript. It is easily readable by humans and machines.",
  "skills-sites": "Website creation",
  "skills-app": "Application development",
  "skills-data": "Data processing",
  "skills-creative": "Creativity",
  "skills-design": "Design creation",
  "portfolio-title": "Portfolio",
  "portfolio-subtitle": "My works",
  "price-landing": "Landing-page",
  "price-landing-price": "Starting from $100",
  "price-landing-description": "A one-page website for presenting services/products/...",
  "price-app": "Web application",
  "price-app-price": "Starting from $350",
  "price-app-description": "An application inside the browser for better comfort",
  "price-site": "Corporate website",
  "price-site-price": "Starting from $350",
  "price-site-description": "A website for your business or company",
  "price-scrap": "Website scraping",
  "price-scrap-price": "Starting from $20",
  "price-scrap-description": "A script for automatic data collection",
  "price-market": "E-commerce website",
  "price-market-price": "Starting from $500",
  "price-market-description": "A tool for your sales online",
  "price-scripts": "Scripts for your page",
  "price-scripts-price": "Starting from $20",
  "price-scripts-description": "I will create a functional script for your website/application...",
  "contacts-subtitle": "Contact me",
  "contacts-social-description": "In any convenient way for you:",
  "contacts-form-title": "Or leave your details and I'll write to you myself:",
  "contacts-name": "Your name",
  "contacts-email": "Your email",
  "contacts-message": "Your message",
  "contacts-send-message": "Send message",
  "contacts-policy-agree": "I agree to the",
  "contacts-policy-link": " privacy policy"
}