{
  "menu-about": "ПРО МЕНЯ",
  "menu-experience" : "МОЙ ОПЫТ",
  "menu-skills": "МОИ НАВЫКИ",
  "menu-portfolio": "МОИ РАБОТЫ",
  "menu-price": "ПРАЙС-ЛИСТ",
  "menu-contacts": "КОНТАКТЫ",
  "name": "Меня зовут Илья Мыльцев",
  "promo-title": "Я web-разработчик из города Белград",
  "about-text": "Умею работать в режиме многозадачности. Обладаю высокими аналитическими способностями, которые позволяют мне эффективно работать с большими объёмами информации, находить качественные решения поставленных задач. Постоянно обучаюсь и практикусь в решении актуальных задач. Вот сферы, в которых я практикуюсь.",
  "skills-web-title": "Web-разработка",
  "skills-web-text": "Кроссбраузерная верстка, создание интерактивных и адаптированных сайтов, веб-приложений нативными средствами, или с помощью Vue...",
  "skills-app-title": "Разработка приложений",
  "skills-app-text": "Разработка web-приложений, SPA с использование фреймворка Vue, библиотеки React",
  "skills-sql-title": "Базы данных",
  "skills-sql-text": "Я имею опыт работы с SQL, включая создание и модификацию баз данных, написание хранимых процедур и функций, оптимизацию производительности запросов. Кроме того, я также обладаю навыками анализа данных, такими как сбор, обработка и интерпретация информации, создание отчетов и дашбордов для поддержки принятия решений.",
  "resume-title": "Чем я буду полезен",
  "resume-education": "Образование",
  "resume-university": "Петрозаводский государственный университет",
  "resume-university-subtitle": "Диплом бакалавра | Петрозаводск (2013-2018)",
  "resume-university-description": "Физико-технический институт. Педагогическое образование с двумя профилями подготовки (физика и математика)",
  "resume-geekBrains": "GeekBrains, Mail.ru group",
  "resume-geekBrains-subtitle": "HTML&CSS 2020",
  "resume-geekBrains-description": "Изучение HTML и CSS, а также препроцессоров, таких как Less и Sass, помогло мне писать более красивый код.",
  "resume-udemy-web": "Udemy",
  "resume-udemy-web-subtitle": "Web-разработчик 2020",
  "resume-udemy-web-description": "Я углубленно изучал веб-разработку, HTML и CSS. Кроме того, у меня есть опыт работы с инструментами сборки, такими как Gulp и Webpack, а также с препроцессорами стилей, такими как Less и Sass/Scss. Я также изучал JavaScript и библиотеку jQuery, что позволяет мне создавать динамические и интерактивные веб-сайты.",
  "resume-udemy-js-react": "Udemy",
  "resume-udemy-js-react-subtitle": "Полный курс по JavaScript + React - с нуля до результата, 2021",
  "resume-udemy-js-react-description": "Я углубленно изучил JavaScript, что позволяет мне создавать динамические и интерактивные веб-сайты. Кроме того, я изучил инструменты сборки, такие как Webpack, и осваивал платформу NodeJS для создания серверных приложений. Я также изучил фреймворк React и библиотеку управления состоянием Redux, что позволяет мне создавать масштабируемые и сложные веб-приложения. Я успешно применял эти знания на практике, создавая различные проекты и участвуя в коммерческих проектах.",
  "resume-ano": "Автономная некоммерческая организация дополнительного профессионального образования 'Центр профильного образования'",
  "resume-ano-subtitle": "Центр профильного образования, Современная Web-разработка, 2021.",
  "resume-ano-description": "В ходе обучения я изучил принципы современной веб-разработки, включая актуальные стандарты HTML и CSS, JavaScript, а также популярные фреймворки и библиотеки, такие как React и Vue3. Я также познакомился с основами работы с серверной стороной, изучив Node.js и базы данных.",
  "resume-experience": "Опыт работы",
  "resume-experience-FD": "Web-developer/Freelance",
  "resume-experience-FD-subtitle": "Since c 2020",
  "resume-experience-FD-description": "В ходе моего обучения и практике на фрилансе я выполнял самостоятельные проекты и практиковался в создании веб-приложений, используя различные технологии, такие как JavaScript, React, Vue, Webpack и другие. Я также принимал участие в разработке приложений и реализации стартап-идей, чтобы получить больше опыта. В моей работе я занимался версткой сайтов, проверкой на кроссбраузерность, рефакторингом своего и чужого кода, работой с данными на серверной и клиентской сторонах, тестированием сайтов и скриптов. Я также активно использовал систему контроля версий Git и практиковал TDD, используя библиотеку Jest для unit-тестирования.",
  "resume-experience-kmis": "Fullstack developer",
  "resume-experience-kmis-subtitle": "K-скай (c 2022)",
  "resume-experience-kmis-description": "Я занимаюсь разработкой фронтенда на React с использованием TypeScript и GraphQL, а также бэкенд-разработкой на Python и Django. Мои навыки также включают работу с базами данных, включая создание структур таблиц, связей и расчетов. Я уверенно выполняю и внедряю новую функциональность, работаю на улучшение SQL-скриптов и создаю аналитику для лиц, принимающих решения (ЛПР), чтобы они могли принимать обоснованные решения на основе данных. Моя работа также включает работу с Celery, Kafka и Redis для обеспечения масштабируемости и надежности приложений. Я постоянно совершенствую свои навыки и увлеченно следую за последними тенденциями в отрасли, чтобы обеспечить оптимальное функционирование приложений."
}